{"id":"1089cd2b-159b-4050-93fb-125ca13743c6","name":"InstallTestCompleteAdapter","friendlyName":"Enable support for TestComplete tests","description":"Installs the modules required to run TestComplete tests by using Visual Studio Test tasks. You can add a Visual Studio Test task after this task and specify a TestComplete project suite (.pjs) as a test source.","helpMarkDown":"","category":"Test","author":"SmartBear Software","minimumAgentVersion":"2.144.0","version":{"Major":1,"Minor":15040,"Patch":421},"instanceNameFormat":"TestComplete test adapter installer","inputs":[{"name":"preferredExecutor","label":"Preferred test runner","type":"pickList","defaultValue":"TE","options":{"TE":"TestExecute","TC":"TestComplete"},"helpMarkDown":"Specifies which product will run tests on an agent if several products are installed. If only one product is installed, it will run the tests."},{"name":"installExecutor","label":"Install test runner","type":"boolean","helpMarkDown":"Applicable only for agents running with full administrator permissions. Specifies whether the specified test runner will be installed on an agent if neither TestComplete, nor TestExecute is installed there. If any test runner is already installed on the agent, it will be used to run tests, and this option will be ignored."},{"name":"updateExecutor","label":"Update test runner","type":"boolean","helpMarkDown":"Applicable only for agents running with full administrator permissions. Specifies whether the specified test runner installed on the agent will be updated to match the extension version. Any patches available for the test runner will be installed as well."},{"name":"accessKey","label":"Access key","type":"string","helpMarkDown":"Optional. If you use the SmartBear ID-based licenses of TestComplete/TestExecute, you can specify the access key assigned to your SmartBear account to license the product instances that will run the tests. If you use the key-based licenses, leave this field empty."},{"name":"searchMode","label":"Search for test cases","type":"pickList","defaultValue":"ExecutionPlan","options":{"ProjectItems":"Among project items","ExecutionPlan":"In Execution Plan"},"helpMarkDown":"Specifies which items the test adapter will treat as tests and where it will search for them. Select 'Among project items' to run script routines and keyword tests that have tags assigned to them, and BDD scenarios. Select 'In Execution Plan' to run Execution plan items marked as test cases. Also, select it if you run tests by using Azure DevOps test plans."},{"name":"logsLevel","label":"Save logs for","type":"pickList","defaultValue":"1","options":{"0":"All tests","1":"Failed tests and tests with warnings","2":"Failed tests only"},"helpMarkDown":"Specifies when a TestComplete log should be attached to a test result."},{"name":"cmdLineParams","label":"Additional command-line parameters for the test runner","type":"string","helpMarkDown":"Optional. Specifies extra command-line parameters that will be passed to TestComplete/TestExecute. For example, you can use the /PrjVar:VarName=VarValue parameter to assign values to project variables in your TestComplete project."}],"execution":{"Node10":{"target":"main.js"}}}